{
  "pageTitle": "AIT OUBELLI | Ingénieur logiciel et passionné de données.",
  "maintenanceBanner": "Ce site est actuellement en maintenance. Nous serons de retour bientôt !",
  "sidebarTitle": "Ingénieur logiciel",
  "navHome": "Accueil",
  "navAboutMe": "À Propos",
  "navEducation": "Éducation",
  "navSkills": "Compétences",
  "navExperience": "Expérience",
  "navProjects": "Projets",
  "navBlog": "Blog",
  "navContactMe": "Contactez-moi",
  "homeWelcome": "Bonjour & Bienvenue !",
  "homeIntro": "Je suis <strong>AITOUBELLI Salah</strong>,",
  "homeAbout": "En tant qu'ingénieur logiciel dédié",
  "homePhilosophy": "Animé par la curiosité et l'innovation, je m'efforce de transformer les idées en applications web percutantes qui améliorent les expériences utilisateur.",
  "homeCtaButton": "Télécharger CV",
  "aboutMeTitle": "À Propos de Moi",
  "aboutMeP1": "Actuellement, je suis étudiant en troisième année à l'Université de Haute-Alsace, où je suis immergé dans un environnement académique stimulant et exigeant. Mon parcours dans l'enseignement supérieur a été marqué par un profond engagement envers l'apprentissage et le développement personnel, tant à l'intérieur qu'à l'extérieur de la salle de classe.",
  "aboutMeP2": "Tout au long de mon séjour à l'université, j'ai eu l'occasion de travailler sur divers projets académiques et personnels, allant d'applications web complexes utilisant des technologies modernes à des jeux console simples mais instructifs qui renforcent les concepts fondamentaux de la programmation. Mon portefeuille de projets diversifié, qui comprend des applications front-end, des solutions côté serveur et des projets full-stack, témoigne de mon adaptabilité et de mon désir d'embrasser de nouveaux défis.",
  "aboutMeP3": "Au-delà de mes activités académiques, je suis un participant actif de la communauté technologique, mettant régulièrement à jour mon GitHub avec des projets qui mettent en valeur mes compétences dans différents domaines, y compris le développement de jeux avec des titres classiques comme Snake et Tetris en JavaScript. Cette approche pratique de l'apprentissage a considérablement amélioré mes compétences en résolution de problèmes et m'a permis de rester à la pointe des technologies émergentes.",
  "aboutMeP4": "Je suis passionné par l'exploitation de la technologie pour créer des solutions percutantes et je suis toujours à l'affût d'opportunités d'appliquer mes connaissances dans des contextes pratiques et réels.",
  "educationTitle": "Éducation",
  "edu1Degree": "Master Informatique spécialité Génie Logiciel",
  "edu1School": "Université de Bordeaux, Bordeaux (33)",
  "edu1Years": "2024-2026",
  "edu1Details": "Axé sur les principes avancés de l'ingénierie logicielle, les patrons de conception et l'architecture de systèmes à grande échelle.",
  "edu2Degree": "Licence Informatique",
  "edu2School": "Université de Haute-Alsace, Mulhouse (68)",
  "edu2Years": "2023 - 2024",
  "edu2Details": "Étude des concepts fondamentaux de l'informatique, y compris les algorithmes, les structures de données et les paradigmes de programmation.",
  "edu3Degree": "Licence Informatique",
  "edu3School": "Université de Mohammed Chérif Messadia, Algérie",
  "edu3Years": "2015-2018",
  "edu3Details": "Études fondamentales en informatique, couvrant la programmation, les bases de données et les réseaux.",
  "skillsTitle": "Compétences",
  "skillsTabAll": "Tout",
  "skillsTabWebDev": "Développement Web",
  "skillsTabProgLang": "Langages de Programmation",
  "skillsTabTools": "Outils & Technologies",
  "skillsFrontendTitle": "Développement Frontend",
  "skillsBackendTitle": "Développement Backend",
  "skillsDatabasesTitle": "Bases de Données",
  "skillsProgLangTitle": "Langages de Programmation",
  "skillsToolsTitle": "Outils & Technologies",
  "experienceTitle": "Expérience Professionnelle",
  "exp1Position": "Chargé d'Études Informatiques",
  "exp1Company": "MAATEC Assurances, Avril 2019 - 2020",
  "exp1Detail1": "Assistance technique et résolution de problèmes dans divers bureaux.",
  "exp1Detail2": "Réparation d'équipements défectueux.",
  "exp2Position": "Stagiaire en Test Logiciel",
  "exp2Company": "ThagasteSoft Technologies, Octobre 2018 - Janvier 2019",
  "exp2Detail1": "Documentation détaillée des procédures de test.",
  "exp2Detail2": "Conception et implémentation de scénarios de test.",
  "projectsTitle": "Projets",
  "proj1Title": "Application Web Algorithmes de Graphe",
  "proj1Description": "Une application web complexe utilisant C++ pour le traitement côté serveur et HTML, CSS, JavaScript pour l'interface utilisateur, implémentant divers algorithmes de graphe et structures de données.",
  "proj2Title": "Jeu Console Chasse aux Fauves",
  "proj2Description": "Un jeu console développé en C++ appliquant les principes de la POO comme l'héritage et le polymorphisme, améliorant mes compétences en C++ et ma compréhension des concepts de la POO.",
  "projectsGithubNote": "Pour plus de projets, y compris des applications front-end, des solutions back-end, des projets full-stack et des jeux classiques comme Snake et Tetris en JavaScript, visitez mon <a href=\"https://github.com/kit0ra\"> portfolio GitHub</a>.",
  "blogTitle": "Blog",
  "blog1Title": "L'Avenir du Développement Web",
  "blog1Date": "Publié le 15 Janvier 2024",
  "blog1Summary": "Exploration des dernières tendances et technologies façonnant l'avenir du développement web, de la conception basée sur l'IA aux applications web progressives.",
  "blogReadMore": "Lire la suite",
  "blog2Title": "Comprendre l'Asynchronisme JavaScript",
  "blog2Date": "Publié le 20 Février 2024",
  "blog2Summary": "Une plongée profonde dans la programmation asynchrone en JavaScript, couvrant les callbacks, les promesses et la syntaxe async/await pour gérer les opérations asynchrones.",
  "moreBlogs": "Plus de Blogs",
  "contactTitle": "Contactez-moi",
  "contactIntro": "Si vous avez des questions, des idées de projets ou si vous voulez simplement dire bonjour, n'hésitez pas à me contacter.",
  "contactEmail": "Email :",
  "contactLinkedIn": "LinkedIn :",
  "contactNameLabel": "Nom :",
  "contactEmailLabel": "Email :",
  "contactMessageLabel": "Message :",
  "contactSubmitButton": "Envoyer le message"
}
